Tekla Open API Reference for Tekla Structures 2025
Symbol Constructor (ViewBase, Point)
 Creates a new symbol instance using the default symbol information and standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Symbol(
	ViewBase View,
	Point InsertionPoint
)
Public Sub New (
	View As ViewBase,
	InsertionPoint As Point
)
Parameters
View
Type: Tekla.Structures.Drawing.ViewBase
The view where to insert the symbol.
InsertionPoint
Type: Tekla.Structures.Geometry3d.Point
The location where to place the symbol.
See Also
Reference
Symbol Class
Symbol Overload
Tekla.Structures.Drawing Namespace